[
{"product_id": "B06WD61CF5", "id": "R1B3KUZSFWFCCP", "title": "The Best value on the Market", "text": "This will be a fairly detailed and honest review.", "score": 5.0, "helpful_vote_statement": 187},
{"product_id": "B06WD61CF5", "id": "R1I1S7BTSONN45", "title": "Better than Lenovo Flex 4 Both are $799", "text": "1. Who is this for?", "score": 4.0, "helpful_vote_statement": 83},
{"product_id": "B06WD61CF5", "id": "R2HAVUL6EN7UYC", "title": "I Am REALLY Excited To Have This Laptop/Tablet Hybrid.  It is Even BETTER Than I Hoped For!!!", "text": "This computer is what I would consider a gateway computer. Those who are looking at upgrading a fairly old or not so powerful laptop and are looking to do a little more productivity, this is a great option.", "score": 5.0, "helpful_vote_statement": 183},
{"product_id": "B06WD61CF5", "id": "R71CERKC623U4", "title": "Works great with Ubuntu Gnome 17.04!", "text": "2. What do you get?", "score": 5.0, "helpful_vote_statement": 90},
{"product_id": "B06WD61CF5", "id": "R2NUMIS0SQ9TRS", "title": "Superior quality & value!", "text": "Well you can probably read the description, however it's worth noting. You get an Intel i7 7500u CPU (dual core with 4 threads) 12gb DDR4 RAM, Nvidia 940mx GPU, a 256gb SSD, 15.6\" 1080p screen, fingerprint reader, and a backlit keyboard.", "score": 5.0, "helpful_vote_statement": 10},
{"product_id": "B06WD61CF5", "id": "R2PFIIA1ZAP80R", "title": "This laptop was great, until it stopped working.", "text": "The reason I mention all of the feautures is because you would be hardpressed to find another laptop with these features for the same price. To my knowledge there is not laptop on the market for $800 with an i7, dedicated graphics, 12gb of RAM and an SSD. This is really one of the best values on the market right now.", "score": 4.0, "helpful_vote_statement": 19},
{"product_id": "B06WD61CF5", "id": "R1P84BJYQ2H3KP", "title": "Ok device, bad customer support and warranty", "text": "With all of that said, this isn't for everyone. If you want to do extensive gaming, this is not for you. Can it game? Yes, light gaming can be achieved, however it isn't marketed as a gaming laptop. Is this for someone who wants to do editing (video, audio, photos)? Yes, again light editing can be achieved.", "score": 2.0, "helpful_vote_statement": 6},
{"product_id": "B06WD61CF5", "id": "RZ7GDZD1CZ2NN", "title": "Best bang for my buck", "text": "What blew me away with this computer is the speakers! They are fantastic! I usually use headphones and would consider myself somewhat picky with sound, and for laptop speakers these are really something great.", "score": 5.0, "helpful_vote_statement": 18},
{"product_id": "B06WD61CF5", "id": "RVPYN6U7E4KLJ", "title": "Totally sweet and loving it, other than the power plug at the laptop.", "text": "This computer is really a middle of the pack all arounders dream. If you dabble in a little of this and a little of that but don't do anything professionally or extremely serious, this is really all you need.", "score": 4.0, "helpful_vote_statement": 12},
{"product_id": "B06WD61CF5", "id": "RURDM1XA5SYHQ", "title": "I liked what this computer had to offer for the price ...", "text": "Also, everyone's experience is different. Some hate loud fans, and if this is pushed the fans will be audible. Some don't like that the backlit keyboard times out after 30 seconds of no use. These things really don't bother me.", "score": 5.0, "helpful_vote_statement": 2},
{"product_id": "B077PQ1VNY", "id": "R1JS91KHMD3NZ2", "title": "Good Basic HP", "text": "I bought this computer for my husband, this is what he said.", "score": 4.0, "helpful_vote_statement": 205},
{"product_id": "B077PQ1VNY", "id": "RDSIXXAR99MGL", "title": "awesome.", "text": " \" I needed a new laptop for work and leisure. In a brief Amazon search, we found this, and purchased it last week.", "score": 5.0, "helpful_vote_statement": 79},
{"product_id": "B077PQ1VNY", "id": "R1HT4931K9EB77", "title": "It's great", "text": "I am highly satisfied with it's speed. Out of the box, in 15 minutes, it was ready to go. The response of the trackpad", "score": 4.0, "helpful_vote_statement": 91},
{"product_id": "B077PQ1VNY", "id": "R1CVXS9WCY4TRA", "title": "Great value", "text": " and keys is outstanding. It is my first touchscreen, so I am getting used to that. It may not be the lightning speed", "score": 5.0, "helpful_vote_statement": 44},
{"product_id": "B077PQ1VNY", "id": "R28D1H62OGKEAK", "title": "Five Stars", "text": "that some reviewers here have complained about , but for personal home office use, this HP laptop is excellent. \"", "score": 5.0, "helpful_vote_statement": 50},
{"product_id": "B077PQ1VNY", "id": "R2M5RWD14HFR4Y", "title": "Best Bang for your Buck.", "text": "bought for my mom for Christmas, and it's awesome! super fast processor and it charges incredibly quick. she couldn't be happier.", "score": 5.0, "helpful_vote_statement": 41},
{"product_id": "B077PQ1VNY", "id": "R1SEU69TAM484Z", "title": "Awesome Laptop (just reinstall a fresh OS)", "text": "At the beginning the start up is slow since its getting stuff ready, but after that it runs smoothly. Great product", "score": 5.0, "helpful_vote_statement": 13},
{"product_id": "B077PQ1VNY", "id": "RS6HIQD87CIT4", "title": "Tarkis ZOne Review:  HP 15.6-Inch HD Touchscreen Laptop Intel Quad Core Pentium N3710 1.6GHz, 4GB DDR3L", "text": "Love the touchscreen. Solid performance. Can't beat the price. No complaints here.", "score": 5.0, "helpful_vote_statement": 25},
{"product_id": "B077PQ1VNY", "id": "R3GCIW0URPETSM", "title": "Do not buy this laptop. I wish I never ...", "text": "Works great, fast, comes with a cool racing game download, plays DVDs & Can't beat the price", "score": 1.0, "helpful_vote_statement": 9},
{"product_id": "B077PQ1VNY", "id": "R2V5DUG0W1QH6G", "title": "Worth Every Penney", "text": "Great Laptop best option for the price love the touch screen also.", "score": 5.0, "helpful_vote_statement": 6},
{"product_id": "B01N5G5PG2", "id": "R347LQPLUFRYA6", "title": "A Great Chromebook... An Even More Amazing Linux-based Development Workhorse", "text": "I've been waiting for this Chromebook for some time now and having only had it for about two weeks, I can say that the device and purchase were well worth it.  To start out, I'm a software engineer working in the realm of cloud DevOps, and multi-platform web and mobile application development. As much of my time is spent writing code as building cloud infrastructure in AWS, Google Cloud, and Azure.  As such, I can defer a lot of horse power to those cloud services and keep my actual computer fairly lean.  After playing with a loaner Chromebook for a couple of months, I found the whole minimalist approach Google has taken with this platform to be totally refreshing, this Chromebook kits that up a notch and then some.", "score": 5.0, "helpful_vote_statement": 1269},
{"product_id": "B01N5G5PG2", "id": "R2PNS3NSROPUX7", "title": "Flip c100 comparison and stylus", "text": "Going to break this down into three parts: Hardware/Design, Use as a Stock ChromeOS Device, and Advanced Usage... In each section, I'll summarize the pros/cons and then at the end will provide a final summary. Hope this helps you get a good idea of what this Chromebook is capable of and why it's such a great buy.", "score": 4.0, "helpful_vote_statement": 207},
{"product_id": "B01N5G5PG2", "id": "R26DBMM4N70Z83", "title": "THE Chromebook to get", "text": "1. Hardware & Design", "score": 5.0, "helpful_vote_statement": 478},
{"product_id": "B01N5G5PG2", "id": "R36SJN5PVJU9RO", "title": "A Commentary on the Core M5 Version.", "text": "Asus has really set a new standard with the C302CA's internals and physical design. Internally this device is basically an entry-level MacBook.  A 12.5\" IPS screen that is gorgeous to look at, extremely bright and full 1080p resolution.  A solid little M3 processor, 4GB of RAM and 64GB of SSD storage make this machine capable of handling heavy usage and earn it a solid Octane 2.0 score in the 19000-20000 range. No slouch.", "score": 5.0, "helpful_vote_statement": 105},
{"product_id": "B01N5G5PG2", "id": "RVI0HU86TZKCU", "title": "Workhorse Chromebook with Backlit Keys!", "text": "The physical design is not just one of the best I've seen in a Chromebook but also in the general \"ultrabook\" form factor with comparable quality and design details associated with MacBook Air, MacBook, Asus' own Zen line, and Samsung's recent Chromebook Plus and Pro offerings.  The case is a solid aluminum billet structure with the now-ubiquitous scissor-action chicklet keyboard.  The surface texture of the case is a satiny paper-like touch, which is both clean and easy to wipe down, but also not so smooth that you have to be concerned with it slipping out of your hand when carrying it. While Samsung has gone with an iPad-esque rounded edge style with their Chromebook Plus/Pro lines, Asus has stuck with a clean, square edge design with subtle beveling reminiscent of miniaturized MacBook Pro 13\".  Even with the 2-in-1 flip hinge, the device has a solid feel and there's very little wobble in the screen while typing. The backlighting on the keyboard is a really nice treat and makes using the Chromebook in low-light settings a dream.", "score": 5.0, "helpful_vote_statement": 60},
{"product_id": "B01N5G5PG2", "id": "R1P56V75AQ80NQ", "title": "42 days to get minor repair complete", "text": "When in the \"flipped\" form factor, you're effectively looking at a 12.5\" Android Tablet experience.  The pop-up keyboard looks just like the Android screen keyboard and the orientation detection and capacitive touch screen are snappy and very responsive.  One place that does frustrate me in the tablet mode is that ChromeOS has a number of UI features that don't lend themselves to touch interaction.  For example, the \"close-X\" button on tabs is very tiny and has a small hit-target area on the screen.  Similarly the task tray area of the main task bar is on the small side and lends itself to fat-fingering.  A simple OS update to make tablet mode \"beef-up\" certain UI components would give this a much more Android-like table experience. More on Android in a bit...", "score": 1.0, "helpful_vote_statement": 50},
{"product_id": "B01N5G5PG2", "id": "RYLE6GRI4BPGR", "title": "This is better than the Sammy Chromebook Pro. It just is.", "text": "The touchpad on the C302CA is the best I've used on a Chromebook to date. It has a glassy-smooth surface that resists finger-prints and goop, is very large, and has a firm but not too-clunky feeling click to it. It takes up more than 1/3rd of the palm-area horizontal space and makes thumb-tapping mouse tweaks very easy.  Likewise, the touch screen has a very nice responsiveness and I regularly find myself just deferring to the touchscreen for scrolling and quick button-clicks.", "score": 5.0, "helpful_vote_statement": 17},
{"product_id": "B01N5G5PG2", "id": "RPNWMFZC99UJ2", "title": "I absolutely love this beyond any computer/tablet device I have purchased in ...", "text": "Finally, there are the ports... and this is where I had the most trepidation about this machine. To keep the lean and skinny profile, Asus (like Apple) has equipped the C302CA with a whopping 2 USB-C ports (one on each side of the keyboard), a micro-SD expansion slot, and a headphone-mic jack.  The USB-C ports can act as the power-jack which is convenient when your power plug is sometimes on the left and sometimes on the right.  Unfortunately, if you're charging the machine, this leaves you with only one remaining USB-C port.  I've purchased a multi-port hub that provides a pass-thru USB-C plug, 2 USB3.0-B plugs, and ethernet jack, and an HDMI-out port. I velcro it to the back of the screen and remove it when I'm using the device in tablet mode (since I usually don't need it wired up in tablet mode).  It gets the job done, but running $50-100 for a good dongle like this, you're adding to the TCO of the device if you need more connectivity than a single USB-C port.", "score": 5.0, "helpful_vote_statement": 15},
{"product_id": "B01N5G5PG2", "id": "R1ZXGTR6FP15TU", "title": "Almost exactly what I've been waiting for...(although less so over time)...and now there are much better alternatives", "text": "The battery life on the C302CA is no joke, either. I've been getting regular 10-11hr usage times between charges and it can get back to fully charged over the USB-C ports in about 2-3hrs.  Really in-and-of-itself that's a great feature by just reducing the need to always lug around a power-brick.", "score": 3.0, "helpful_vote_statement": 146},
{"product_id": "B01N5G5PG2", "id": "R3RXPFUAIPX0V5", "title": "Asus vs Samsung", "text": "Pros:", "score": 5.0, "helpful_vote_statement": 11},
{"product_id": "B06WD61CF5", "id": "R2FPJD4U154SLJ", "title": "Should charge via USB-C but otherwise great laptop", "text": "I just bought this laptop for software engineering work and I really do enjoy it. After purchase, I installed Ubuntu 16.04 with no hassle, and so far I have been pleased with the ergonomics and relative ease of use. The SSD is also a boost and blows Hard Disks out of the water in terms of application load times, and there is plenty of RAM for most applications and common use. I don't have much to say about the touchscreen, but it works fairly well.", "score": 4.0, "helpful_vote_statement": 3},
{"product_id": "B06WD61CF5", "id": "R2WE8OLRJSLTE9", "title": "do not let them dupe you into spending wasted time on technical support", "text": "The only complaint I do have is that there is a USB C-type port, which for some reason, does not charge the laptop. This would be a 5 star laptop if the USB C port was both for charging and data, since I would then only need to carry a single charger for my phone and laptop. To me this is just Acer missing the ball here, since USB-C spec is proven and starting to be adopted by more device manufacturers.", "score": 1.0, "helpful_vote_statement": 4},
{"product_id": "B06WD61CF5", "id": "R1MM98GF5PXQ3Q", "title": "Lemon", "text": "WARNING: Acer does not have a warranty department. If you have a hardware issue with your purchase when you receive it, do not let them dupe you into spending wasted time on technical support. Insist on sending the computer in for a repair if necessary. Be persistent, and you may reach somebody helpful. DO NOT LET THEM convince you that you need to pay for the repair.", "score": 1.0, "helpful_vote_statement": 3},
{"product_id": "B06WD61CF5", "id": "R1ZPAC798WFF8E", "title": "For : Gaming & Industrial Design , it was just what i was looking for!", "text": "That said, sound quality was terrible on arrival. I have been wrestling with their phone support to get this thing sent in for repairs. We've had it less than 24 hours. I may be returning this instead of getting it repaired, as it seems to be less of a hassle.", "score": 5.0, "helpful_vote_statement": 4},
{"product_id": "B06WD61CF5", "id": "R1TRB5TXT3OIJH", "title": "Really good laptop", "text": "Keyboard quit working eight months after I bought it. On mine help very unhelpful. I had to send the entire computer back to the factory to have him look at it. I had to send it back AT MY EXPENSE. Estimated turnaround time for repairs three weeks. This is unacceptable. Incidentally, before contacting their repair, I contacted local shops here. None of them would touch Acer and none of them had anything good to say about the brand", "score": 4.0, "helpful_vote_statement": 2},
{"product_id": "B06WD61CF5", "id": "R3CTJYB96UUWPG", "title": "Very good versatile machine!", "text": "After looking for a replacement for a few months, I finally found something that had better than average specs and a good quality overall. The best part about it, the screen quality and overall feeling of robustness of the laptop, even though is a convertible one.", "score": 5.0, "helpful_vote_statement": 2},
{"product_id": "B06WD61CF5", "id": "R2TFYFOL4EA697", "title": "a great laptop all around", "text": "Pros", "score": 4.0, "helpful_vote_statement": 3},
{"product_id": "B06WD61CF5", "id": "R1AJX5575IKFX3", "title": "Excellent quality and value. Acer is doing very well.", "text": "Amazing Screen Quality", "score": 5.0, "helpful_vote_statement": 0},
{"product_id": "B06WD61CF5", "id": "R1I7EI3S8NKDT2", "title": "So far I really like the design and the feel of this laptop", "text": "Can it handle Adobe programs, several at the same time?: Yes!", "score": 4.0, "helpful_vote_statement": 2},
{"product_id": "B077PQ1VNY", "id": "R23HPWD7DJX2NI", "title": "Do not buy!!", "text": "I don’t know why you can’t put zero stars but this computer is a piece of junk. We had it 12 hours, 8 of those were overnight and it stopped working. I spent an hour with customer support. The keyboard just stopped working. Please do not buy it. Plus it came with the price tag on it and it was $249. I paid 326$", "score": 1.0, "helpful_vote_statement": 4},
{"product_id": "B077PQ1VNY", "id": "R187RC6QEKPQQ5", "title": "Do not order from maze tech", "text": "I ordered a new version of this laptop and received a used one that had not even been reformatted. It popped right up to the previous owner's picture and log in. On top of that, the keyboard does not work.", "score": 1.0, "helpful_vote_statement": 44},
{"product_id": "B077PQ1VNY", "id": "R1LZ5J3IU9LLBZ", "title": "Five Stars", "text": "My niece loves it She loves that she can touch the screen", "score": 5.0, "helpful_vote_statement": 6},
{"product_id": "B077PQ1VNY", "id": "R3RC38LAGXQ5RT", "title": "The unit that arrived was faulty. It could not ...", "text": "The unit that arrived was faulty.  It could not find my home network and saw nothing but the HP printer sitting beside it.  My previous computer saw not only my home network but about six in the neighborhood besides.  I fooled with it for longer than I should have spent on it and returned it.", "score": 1.0, "helpful_vote_statement": 12},
{"product_id": "B077PQ1VNY", "id": "R3LJFSVNX9HRUD", "title": "Husband is very happy. Enjoys the touch screen the most", "text": "Husband is very happy.  Enjoys the touch screen the most.", "score": 5.0, "helpful_vote_statement": 7},
{"product_id": "B077PQ1VNY", "id": "R22J653PBGDZV3", "title": "Great for school", "text": "I am very pleased with this laptop.  I purchased it because I’m taking classes for Pharmacy Technician and it is exactly what I need.  Not a lot of bells and whistles; just the basics. I love that it’s touchscreen too!  And that’s perfect for me!", "score": 5.0, "helpful_vote_statement": 4},
{"product_id": "B077PQ1VNY", "id": "R2KWHYRKRIRUI5", "title": "Four Stars", "text": "It works great no problem so far other than a clicking sound", "score": 4.0, "helpful_vote_statement": 5},
{"product_id": "B077PQ1VNY", "id": "R223DAYKQYPU5G", "title": "I thought it was beautiful the screen was so bright and clear", "text": "My note is a cry for help..I ordered this computer back in January here it is May and I have not been able to use it...I ordered it because it has a disk drive and my old one does not and here I am on my old one...I am 85 years and not real computer literate....When it first came I was so excited, I thought it was beautiful the screen was so bright and clear, and it let you know if the cap lock was on, something my old on did not and had me quite frustrated at times...Well to get back to the beginning I answered all the questions then it said the wanted my password it did not make sense to me since I had just received it and had not given it a password but I entered every password I could think of then it rejected every one then proceeded to shut me out...It keeps saying to go to this site on computed but I cannot get into the computer.  My children both looked at it but don't know what to do they say send it back but I have already threw away the wrapping I don't see how I can afford to go to repair shop and if  don't know it's secret  password how would they....What do all of you out in computer land advise me to do Joanne Price", "score": 1.0, "helpful_vote_statement": 4},
{"product_id": "B077PQ1VNY", "id": "R3T7E32APMSIF7", "title": "Four Stars", "text": "Works for me, the battery is not quite there yet but charges real fast.", "score": 4.0, "helpful_vote_statement": 3},
{"product_id": "B01N5G5PG2", "id": "R3C6HOLYRE2ES0", "title": "For the price you're getting an excellent device ....", "text": "I'm coming from owning a 1st Gen Chromebook Pixel for the last 4 years so that will obviously influence this review.", "score": 4.0, "helpful_vote_statement": 9},
{"product_id": "B01N5G5PG2", "id": "R1USV1O23K0N6E", "title": "Easily the best Chromebook right now", "text": "I was upset when Google announced the first gen $1,000 Chromebook pixel would not be able to run Android apps.  It's such a nice computing experience it terms of the quality of everything that I decided I wanted to find a device with similar capabilities and materials but not spend as much just in case Google decides to screw me over again.  Finally, the Samsung Chromebook pro came out which I was convinced would fit the bill but unfortunately the typing experience ruined the entire package so back to the store it went.  Then the ASUS flip C302 came into my life:", "score": 5.0, "helpful_vote_statement": 15},
{"product_id": "B01N5G5PG2", "id": "R1MH0WRYWSEH94", "title": "I absolutely love this Chromebook", "text": "*Battery* - Battery life is great.  Depending on my use i can get 6-9 hours of use between charges.  Speaking of charges, it's so nice to be able to use USB C.  Our phones are USB C so one cable does everything for me.", "score": 5.0, "helpful_vote_statement": 8},
{"product_id": "B01N5G5PG2", "id": "R2C3I09J42198E", "title": "Finally the Chromebook we've been waiting for!", "text": "*Keyboard* - The keyboard is alright.  It's miles better than the Samsung Chromebook plus or pro, but still miles behind the 1st gen Chromebook pixel that I'm leaving.  The backlight works great and I had no problems using it in the dark.", "score": 5.0, "helpful_vote_statement": 10},
{"product_id": "B01N5G5PG2", "id": "R2SBIZ70FX1ULI", "title": "Excellent value - great for streaming, browsing the web, working with google docs, using a gamepad to play games, etc.", "text": "*Track pad* - The trackpad is well done.  It's a nice smooth surface so no tension when gliding across it.  Multi-touch input works great.  I have no complaints in this department.  It's not quite as nice as a MacBook pro but given the price difference, it's not far away.", "score": 5.0, "helpful_vote_statement": 7},
{"product_id": "B01N5G5PG2", "id": "R1GDN967942DH0", "title": "Short Romance Now Dead", "text": "*Android Apps* - Android apps have a long way to go before they work like first class citizens on Chrome OS.  They work, technically they work, but it's hit or miss in terms of does an app properly support tablet mode or is it a phone app stretched across the screen.  If it renders in tablet mode, is it cutting off some of the app (sometime bottoms of apps are cutoff)?  80% of the apps it's a poor experience.  20% of the apps it's a decent experience.  This will get better with time.", "score": 1.0, "helpful_vote_statement": 17},
{"product_id": "B01N5G5PG2", "id": "R1WJ029YUMA38X", "title": "Now I know why they call it a motherboard", "text": "I'll point out that Google doesn't allow any Android application to be device administrator on a Chromebook so any MDM/MAM apps (intune, airwatch, mobileiron, MaaS360m etc) that requires device admin privileged will not work.", "score": 1.0, "helpful_vote_statement": 16},
{"product_id": "B01N5G5PG2", "id": "R2ZIUDMJ98YLAD", "title": "The ASUS Chromebook Flip C302CA Has More Than Met My Expectations", "text": "*Build Quality* - I'm really pleased with the overall quality.  The frame/body is awesome and metal.  There is no wiggle or wobble or creaks or groans or nothing.  It's solid.", "score": 5.0, "helpful_vote_statement": 7},
{"product_id": "B01N5G5PG2", "id": "R1DSVW6QUX0OSD", "title": "Great overall laptop with a few issues.", "text": "Overall, I’m happy with this purchase and have no issues keeping it as my daily driver.  This is a great device and the $450 asking price seems fair.", "score": 4.0, "helpful_vote_statement": 7},
{"product_id": "B01N5G5PG2", "id": "RP0APP58RJ4IL", "title": "Happy with the purchase", "text": "I’m a professional IT guy.  So when I buy something for myself, I know what I’m looking for and I do my homework. This is easily the best overall Chromebook out there right now (under $500).  There’s nothing I don’t like about this device, so in order of importance, here’s what I love about it.", "score": 5.0, "helpful_vote_statement": 8},
{"product_id": "B01N5G5PG2", "id": "RIKQQ54V3P4UD", "title": "An Absolutely Wonderful Upgrade for All Chromebook Users", "text": "I just wanted to echo the positive reviews.  This is a spectacular Chromebook.  I've had an Acer 720 since Jan 2014 (and have been happily Windowsless since that time).  Even though I've found many of the newer models sexier, I was never able to find an upgrade that was as speedy and portable as the 720.  However, this new Asus 302CA is what I've always wanted out of a Chromebook, and it is an amazing step up from the Acer.  It's faster, the screen is MUCH nicer, and it has twice the memory and four times the drive space.  As a professor, I've found my Chromebook to be an indispensable tool in the classroom, at home, and at the coffeeshop, and because the hardware of this Asus is so fantastic, this computer will likely serve me just as long (if not longer) than my Acer 720 (which is still going, it's worth noting).", "score": 5.0, "helpful_vote_statement": 9},
{"product_id": "B01N5G5PG2", "id": "RLU573YP7W3PH", "title": "This is quite possibly my favorite computing device I have ever owned", "text": "All through college I had been telling myself, I would like to try a chromebook, but I needed too many windows dependent programs for my engineering classes to justify the expense.  Now that I'm graduated, I wanted something to replace my Samsung Note Tablet which was starting to show its age after years of faithful service.  I decided that because I often found myself wanting to type when using my tablet, a 2 in 1 would be a good option for me.", "score": 5.0, "helpful_vote_statement": 6},
{"product_id": "B01N5G5PG2", "id": "R1ZR97MA5SB1CN", "title": "Excellent Product That I Spend Eight Paragraphs Writing About", "text": "I am so glad I took this plunge!", "score": 4.0, "helpful_vote_statement": 31},
{"product_id": "B01N5G5PG2", "id": "RYZVM2W6UKRD9", "title": "Great device with a slight build defect", "text": "I use it every day.  It's light enough to carry pretty much every where.", "score": 4.0, "helpful_vote_statement": 7},
{"product_id": "B01N5G5PG2", "id": "R2OKKTJ7D55HBJ", "title": "Very nice premium feeling Chromebook", "text": "It starts up, runs without issues.  Not long ago, I replaced the hard drive in my Toshiba laptop with an SSD, and in regards to speed and general \"snappy\" feeling, there was as much of a difference between the SSD and this as there was in the SSD upgrade over the hard drive.", "score": 5.0, "helpful_vote_statement": 6},
{"product_id": "B01N5G5PG2", "id": "R3E6EQFR9015J3", "title": "The best chromebook for the money right now", "text": "I love that I can let other people borrow my computer without compromising my privacy.  I also like taking it to work, logging into my managed G-Suite account and knowing that my work account can't \"see\" anything I do on my personal account.", "score": 5.0, "helpful_vote_statement": 7},
{"product_id": "B01N5G5PG2", "id": "R14LB7AS7HBL9Y", "title": "Amazing Chromebook!!!", "text": "I mostly use it for playing a couple of games, surfing the web, managing my calendar/tasks lists, reading e-books, that sort of thing.  Between being able to do a surprising amount with chrome extensions and being able to run android apps on it, there isn't much it hasn't been able to handle.  It plays nicely with nearly everything I have wanted to do.  I even use MightyText to get and send text messages with it.", "score": 5.0, "helpful_vote_statement": 6},
{"product_id": "B01N5G5PG2", "id": "R2UEU27ZDTFEW8", "title": "Trying to use this for work? Proceed with caution", "text": "The keyboard is small, a little weird and takes some getting used to, but I find myself actually preferring to use it over other keyboards.  People preferring tablet mode may want to consider the Samsung Chromebook Plus or Pro because the screen dimensions are more tablet like, but since I find myself using it mostly in computer mode and like having the option of the tablet, I think this screen is beautiful.  The resolution is great.  Even the speakers are way better than I expected from a 2 in 1 at this price point.", "score": 5.0, "helpful_vote_statement": 29},
{"product_id": "B01N5G5PG2", "id": "R38DX11GX4PDQ", "title": "Love this Chromebook!", "text": "I would recommend it highly to anyone who wants a light-weight device to use for work or play, especially if you can be flexible in the software that you use.", "score": 5.0, "helpful_vote_statement": 6},
{"product_id": "B01N5G5PG2", "id": "R1DRN1ED05WEMC", "title": "Simply the best Chromebook I've ever personally used.", "text": "The very first Chromebook I ever owned was the first Samsung Chromebook. My mom bought it to do schoolwork, found out that it didn't have Office, and then put it in her closet where it lied for two years. She noticed that she still had it, then started talking to me about how useless it was. I had already been using Google Docs for school at this point, so she decided to give it to me in case I could find any utility in it. For 3 years, I used that thing for everything from reading comics to writing school papers. However, it's began to truly show its age lately, so I began researching what Chromebook to buy next. I really wanted a Dell 13, but Dell isn't interested in stocking it any more, so I decided to buy this Chromebook, the Asus Flip C302. It has made all the difference.", "score": 5.0, "helpful_vote_statement": 4},
{"product_id": "B01N5G5PG2", "id": "R2ILU4RJYU102K", "title": "Graphics problems in 2/3 Asus C302s I bought", "text": "It was an amazing laptop, until the graphics card started rotting after a month. I returned the 1st one I got and Amazon sent me another one and I started to experience a failing graphics card after just 1 day of use, so now I'm stuck with this because I'm sick and tired of calling 4 people just to get an end response of \"Drop it off at a UPS station for return/repair\".", "score": 2.0, "helpful_vote_statement": 7},
{"product_id": "B01N5G5PG2", "id": "R1U0EOXBWXSYQB", "title": "Excellent build quality...lackluster trackpad", "text": "I titled this \"Graphics problems in 2/3 Asus C302s\" because I've purchased 3 and out of 3, 2 of them are experienced graphics problems.", "score": 3.0, "helpful_vote_statement": 6},
{"product_id": "B01N5G5PG2", "id": "R2V9G77AR6YHYJ", "title": "It just works every time I open the screen. ...", "text": "The one that is working is one I bought for my sister's birthday a while ago, and it never gave her trouble.", "score": 5.0, "helpful_vote_statement": 6},
{"product_id": "B01N5G5PG2", "id": "RAGONDVWWT0HK", "title": "Elegant design, fast and expensive", "text": "I'm a big believer in Chromebooks, and I really wanted to like this device. The build quality is fantastic. All metal body, very slim form factor, and has a pretty decent touchscreen. The thing that made me return it was the trackpad. The trackpad was very glitchy. Often the cursor would jump across the screen or take multiple swipes to get it where I wanted because the first didn't register. I had the trackpad speed maxed out and it still was bugging out. I'm not sure if it was a hardware issue or software, but I couldn't take it after about a week. I've read others having the same trackpad issues on reddit.", "score": 4.0, "helpful_vote_statement": 4},
{"product_id": "B01N5G5PG2", "id": "RDI5MSXSEG450", "title": "Outstanding New ASUS C302CA Chromebook Flip with an Elegant Design, Superb Components, Strong Performance, and Great Versatility", "text": "So just beware. If it is indeed a software thing and it's fixed, I would highly recommend this device. Came with the playstore enabled on the beta channel.", "score": 5.0, "helpful_vote_statement": 5},
{"product_id": "B01N5G5PG2", "id": "R3VVOTCEDITIY", "title": "Very Fast; Great Screen and KB; lacks a good Word Processor", "text": "It just works every time I open the screen.  Very simple, this is what I wanted.", "score": 4.0, "helpful_vote_statement": 3},
{"product_id": "B01N5G5PG2", "id": "R10EUH90X6F8XP", "title": "Perfect hybrid device!  My first Chromebook and I am loving it so far", "text": "Originally bought a Samsung Chromebook Pro, but encountered the phantom touch issue and returned it for this.", "score": 5.0, "helpful_vote_statement": 4},
{"product_id": "B01N5G5PG2", "id": "R3JZDSKPH1J3BM", "title": "Apple needs to step up their game...", "text": "Edit: I've had this Chromebook now for about 4 months and just about everything is working as expected.  The only 'issue' that we have found with the Chromebook is that the battery does not last quite as nearly long as it used to.", "score": 4.0, "helpful_vote_statement": 3},
{"product_id": "B01N5G5PG2", "id": "R2K0J1YIMPRXL8", "title": "I finally chose this one mainly because the design is so much better (it looks more like a MacBook", "text": "Edit 2: 8 Months in and everything is working great.  A Powerwash corrected the short battery life issue that was previously encountered.  Battery life is phenomenal again.  Zero complaints.", "score": 5.0, "helpful_vote_statement": 3},
{"product_id": "B01N5G5PG2", "id": "R2P56OQQ045JR6", "title": "Best Chromebook I've used - but ASUS still needs better QC", "text": "This Chromebook with Intel m3 is faster than my Lenovo", "score": 4.0, "helpful_vote_statement": 3},
{"product_id": "B01N5G5PG2", "id": "R3MRXT4FAHAH60", "title": "Hope the replacement doesn't break within the first week of having it.", "text": "It was working great the first few days.  Then the screen wouldn't turn on.  Probably a bad graphics card is my guess as it wouldn't power my external monitor either.  So I'm sending it back and getting a new replacement.  Build quality and design are top notch.  Very Apple like.  Why Apple can't give me a $500 laptop with a touch screen is beyond me.  Apple has pretty much lost me as a customer.  Heck, they don't even have a laptop with a touch screen at any price.  So 2011 macbook will be my last.  I'm going to the cloud with google.", "score": 4.0, "helpful_vote_statement": 8},
{"product_id": "B01N5G5PG2", "id": "R1J3Y4I6HA00J5", "title": "Perfect for the casual student", "text": "I really do love this Chromebook because it provides a large amount of utility and is perfect for a university setting and environment. It has a light design making it easy for travel, reasonably small screen that makes it easy to use on your lap or in class, and a quality chassis to give it that nice premium feeling almost like a shiny Apple Mac. I have yet to run issues with too many tabs, videos, or other tasks running at the same time and thus this computer allows great management of the school or work purposes. Of course, with all Chromebooks runs the issue of al t of popular software not being available to this device such as Microsoft Office, however much of this software is easily replaced with the Chrome App Store and/or Android App Store. The biggest benefit with this computer for me is the longevity of the battery life with this thing. I am able to get around 2 days of use with this computer until I need to charge. This may be a higher end Chromebook, but it is perfect for the casual student or worker looking for a convenient laptop to simply edit documents, surf the web, share and organize files, and watch videos on.", "score": 5.0, "helpful_vote_statement": 5},
{"product_id": "B01N5G5PG2", "id": "R2AFUSAWF1F7DG", "title": "Makes an Excellent Large-size Book & Comic Book Reader", "text": "I bought this because I needed a larger touchscreen for reading Golden Age comic books in CBT format. And plays and poetry eBooks  that lose format on Kindles. I could have bought a second Windows laptop. But I chose a second Chromebook. No need to keep security software up-to-date.", "score": 5.0, "helpful_vote_statement": 5},
{"product_id": "B01N5G5PG2", "id": "R3R7HI03NO8IGR", "title": "This Chromebook could be your new tablet", "text": "I switched to the Beta Channel after turning it on.  Installed Perfect Viewer and Kindle software. My very specific needs are well met. I read Marvel Family and Ben Jonson in comfort.", "score": 5.0, "helpful_vote_statement": 3},
{"product_id": "B01N5G5PG2", "id": "R3TK2437XU5Y7G", "title": "Good device", "text": "The device is so sturdy and clean looking it is a pleasure to hold in my hands.", "score": 5.0, "helpful_vote_statement": 5},
{"product_id": "B01N5G5PG2", "id": "R15U3USLKC8GOZ", "title": "Dead after 6 months. Battery fatally flawed", "text": "With Play Store integration standard now, a full metal shell, 1080p touchscreen with 360-degree folding and full backlit keyboard... This Chromebook can be your next Android tablet and you won't have to spring for the separate keyboard.  This device now provides the best of what a high-end tablet can do (with better specs here) in combination with the experience provided by a laptop. Unlike a standard Android experience, ChromeOS is centered around the Chrome web browser. This means that you don't need an app for Gmail, an app for hangouts, an app for gCalendar, etc. You access all these things via the browser the same way you do on your PC. If you need an app for something specific like a game or airline or TV viewing service, you have that option. This is really the best of both worlds!", "score": 1.0, "helpful_vote_statement": 6},
{"product_id": "B01N5G5PG2", "id": "R347L7T5H7U41F", "title": "My favorite Chromebook yet.", "text": "Samsung was close with their Chromebook Plus and Pro models but this Asus still ultimately wins the day in a couple of key areas. The keyboard and touchpad experience are pivotal for a device like this and what Asus delivers is very satisfying. Backlit, properly spaced keys allow even guys with large hands to use this keyboard comfortably in any lighting. The Asus is a bit wider than the Samsung models which have smaller more cramped non-backlit keyboards.", "score": 5.0, "helpful_vote_statement": 13},
{"product_id": "B01N5G5PG2", "id": "RNKVIMYL4P2CQ", "title": "Great Chromebook (Seriously it is really good)", "text": "You probably read that the Samsungs have a superior screen which according to the specs they do, but the 1080p delivered by the Asus is not only fully usable but more ideal for video and game content. The reality is that the 2400x1600 on the Samsung is not only NOT their recommended setting in the UI, it's barely usable anyway as everything on the screen is so tiny.  Asus didn't play these games and just gave you a perfect 1080 display.", "score": 5.0, "helpful_vote_statement": 3},
{"product_id": "B01N5G5PG2", "id": "RFYA3JZLCH9XS", "title": "In love with this chromebook!", "text": "The Core M3 is a great workhorse CPU and should be the minimum spec you consider if looking for anything more capable than a standard tablet using a mobile CPU (ARM).", "score": 5.0, "helpful_vote_statement": 4},
{"product_id": "B01N5G5PG2", "id": "R2YW7WASHU71ZP", "title": "Cons outweigh the pros for me, but may be right for you", "text": "64GB of storage provided in the Asus is also another clear winner with the others offering 32GB.", "score": 3.0, "helpful_vote_statement": 4},
{"product_id": "B01N5G5PG2", "id": "R2DS8JL0KMRPM0", "title": "Laptop and tablet replacement for me.", "text": "I did my research before purchasing and even had a Samsung Chromebook Plus in my hands before deciding on this machine. I have only had this machine for a day, so if I experience any problems I will come back and change the review.", "score": 5.0, "helpful_vote_statement": 3},
{"product_id": "B01N5G5PG2", "id": "R2NW4E33ANB8ET", "title": "This is a really nice laptop.", "text": "At the moment, it is everything it was advertised to be.", "score": 5.0, "helpful_vote_statement": 2},
{"product_id": "B01N5G5PG2", "id": "R1AVYYXD5C4VM4", "title": "A premium product at a premium price. USB-C Charging!", "text": "Hardware -", "score": 5.0, "helpful_vote_statement": 2},
{"product_id": "B01N5G5PG2", "id": "R34GAEAZ25HNC", "title": "Love this chromebook! If you want to run Android apps, read at least the final paragraph of the review.", "text": " * Very solidly built and it transitions nicely from laptop to tablet mode.", "score": 5.0, "helpful_vote_statement": 11},
{"product_id": "B01N5G5PG2", "id": "RY0BNRP00JN3D", "title": "The Best Chromebook", "text": " * The Keyboard was key for me and probably made the difference between the Samsung Chromebook Pro and this machine. I will primarily use this machine to write, so I need a nice keyboard. It feels very nice and I also really like the backlit keys in the dark.", "score": 5.0, "helpful_vote_statement": 5},
{"product_id": "B01N5G5PG2", "id": "R117TWRUKEMCWA", "title": "Fail - 10% Volume from headphone jack (verified and confirmed by this home tester)", "text": " * The screen is more than adequate for me, although I have not used it outside much yet. It is as good or better than any laptop or tablet that I have had yet. Just for comparison, I have a 2009 Macbook and an Amazon Kindle Fire 8.9 HDX. I have also had a Nexus 7 tablet from Asus. I actually prefer the wider aspect ratio versus the Samsung Chromebook Plus/Pro, because it feels closer to the Macbook that I have been using for years.", "score": 3.0, "helpful_vote_statement": 3},
{"product_id": "B01N5G5PG2", "id": "R1ALW9VZ64GWZT", "title": "Believe the great reviews on this 2 in 1", "text": " * It certainly feels bigger as a tablet, and I will not use it in that mode to read books often, because I still have my Kindle Fire at home, but I love the tent mode for watching content or reading on a table. The hinges are very solid and hold well in either laptop or tent mode. Also, I prefer that balance on this machine versus the Samsung Chromebook Plus. I will use it primarily as a laptop and it sit very solidly in my lap or on a table.", "score": 5.0, "helpful_vote_statement": 3},
{"product_id": "B01N5G5PG2", "id": "R1VTUE51TRNH0S", "title": "Highly recommended", "text": "  * Battery - I cannot really speak to the battery life yet, but as a power user with lots of tabs and several apps open, it is giving me a days use 5+ hours of use so far.", "score": 5.0, "helpful_vote_statement": 11},
{"product_id": "B01N5G5PG2", "id": "R3FDTJTLHLKG1S", "title": "This is a fantastic portable solution!", "text": " * The USB-C ports are working well, and I bought a multiple port adapter, which gives me a regular USB port along with a HDMI port an another USB-C port for charging. It worked right away, so I have all the ports I need.", "score": 5.0, "helpful_vote_statement": 3},
{"product_id": "B01N5G5PG2", "id": "R37CKPGANJWT9P", "title": "Good value, great screen", "text": "Software", "score": 5.0, "helpful_vote_statement": 3},
{"product_id": "B01N5G5PG2", "id": "R3MAOFHJ3RSZ0U", "title": "Came with broken left hinge, sounds like no warranty...", "text": "Great except came with a bad left hinge.  Asus support seems to want to make this an accidental damage instead of warranty.  The thing never opened right from day 1.  I can't recommend purchasing this based on what happens if you need support.", "score": 1.0, "helpful_vote_statement": 34},
{"product_id": "B01N5G5PG2", "id": "R2FKOZJDHJHZU2", "title": "Christmas gift disappointment...", "text": "Great machine out of the box... BUT after only a couple of days the thing just turned off and won't turn back on again... I tired every remedy found online, and even got in touch with Asus tech support who just said \"send it back\"...  This seems to be a somewhat common issue with Chromebooks but this Asus model doesn't have a way to preform an external reset, which is a big problem if you've setup any personal info on it and it has to be sent back.  AND apparently Amazon is experiencing a supply shortage because my replacement isn't expected until sometime between Jan 11th to Feb 5th!  I purchased this for a Christmas gift (bought on Nov 28th and received Dec 7th) and so next month, or maybe even the next is totally unacceptable...  Everything (covers, etc...) is going back in efforts to find something that works before Christmas...  I don't usually leave bad reviews and I totally get supply issues, but after searching online, I found that these things seem to have tendencies towards intermittent power issues (battery not charging, etc.. and this one in particular has no way to reset...) I wish I would have known that BEFORE buying...", "score": 1.0, "helpful_vote_statement": 11},
{"product_id": "B01N5G5PG2", "id": "R1624KWJS7E01W", "title": "The search for the near-perfect chromebook is over!", "text": "I'm very very happy with this fast lightweight convertible chromebook and my search has concluded.  Had been waiting since October for the Samsung Chromebook Pro release to replace my 10\" Flip and 13.3\" Acer R13 but this Asus C302CA (AKA Flip 2.0) chromebook is clearly the winner for me.  Has everything I was looking for, such as touch screen capability, tablet convertible, small bezel, lightweight and small footprint, *backlit* keyboard, not one but two **USB-C** ports, Octane 2.0 score of approximately 25,000, HD display resolution, and responsive trackpad.  Android apps run pretty well on this chromebook also.  If I had to find things to improve, I would shrink the bezel size even more, and push out the screen size to 13.3\" while only slightly increasing the footprint size of the chromebook overall.  And 8GB memory wouldn't hurt.  This chromebook has *no* USB 2.0/3.0 ports but I don't see this as a negative when you have two USB-C ports available.", "score": 5.0, "helpful_vote_statement": 26},
{"product_id": "B01N5G5PG2", "id": "R19V34EFTQ07D2", "title": "Pleasantly surprised with the keyboard and performance", "text": "Excellent value. As a lifelong Windows user, my frustration with Microsoft's operating system was at an all time high as every update seemed to introduce so many more problems that were previously nonexistent. A new update would occur, and all of a sudden, some drivers would stop functioning, preventing me from carrying out tasks that I would do on a weekly basis.", "score": 5.0, "helpful_vote_statement": 4},
{"product_id": "B01N5G5PG2", "id": "R28QU9KTQ6Z01Y", "title": "I'm In Love.", "text": "I finally decided to switch to a more lightweight operating system, and bought the Asus Chromebook Flip C302CA. My wife previously used the C100PA, and loved it.", "score": 5.0, "helpful_vote_statement": 11},
{"product_id": "B01N5G5PG2", "id": "R3R1G6MENYZC3P", "title": "Great Chromebook", "text": "This chromebook is great system that is lightweight, has excellent battery life, and offers a fantastic keyboard. I used to have a Thinkpad T470, which is on another level in terms of keyboard excellence, but the typing experience on this C302 is actually a pleasant surprise. I have not fiddled around much with the touchscreen yet, but it seems very responsive. I have yet to experience any slowdowns on this machine. Overall, I am pleased with the purchase. If you are not tied to any software on Windows, then I highly recommend picking up this chromebook.", "score": 5.0, "helpful_vote_statement": 2},
{"product_id": "B01N5G5PG2", "id": "RUJSO9VNHDMZ9", "title": "Power Supply/ Battery stopped working after 2.5 months!!!", "text": "I rarely review products, but I am blown away by this little beast.  I'm not super technology-literate, but I know I don't want lag, and I don't want something heavy.  I do want something with a long battery life.  I consistently have 10+ tabs open running all sorts of things from Pandora to YouTube videos to client websites, so I was very hesitant to get a Chromebook because I worried about lag.  Guess what.  No lag.  This puppy starts up quickly and has done everything I've asked it to.  I tried to put it through the ringer and force it to get laggy by opening multiple apps, multiple browsers all running videos or playing music, and it handled everything I put it through beautifully.", "score": 1.0, "helpful_vote_statement": 7},
{"product_id": "B01N5G5PG2", "id": "RJL45OI2WK84O", "title": "Awesome laptop. I was skeptical about the ChromeOS", "text": "It is very light, and it seems surprisingly sturdy.", "score": 5.0, "helpful_vote_statement": 3},
{"product_id": "B01N5G5PG2", "id": "R29YR493CHWM5Y", "title": "I LOVE this Chromebook", "text": "THE KEYBOARD.  Oh, the keyboard.  It's very crisp and responsive.  I didn't even know I really cared about the keyboard, but apparently I do now, because I don't want to use another keyboard.  I could imagine this potentially (maybe?  Although maybe not at all!) being a bit small if you have incredibly large man hands, but for my normal lady-lands, it's perfect.  I realize I'm probably the only person who ever makes use of it, but I do miss the \"delete\" button.  Alt + backspace is helping us work through that, though.", "score": 5.0, "helpful_vote_statement": 2},
{"product_id": "B01N5G5PG2", "id": "ROB25V7GMY7XD", "title": "Excellent chromebook", "text": "I really like being able to download Google Play Apps (do a bit of a Google to figure out how to get access to those), and I've had no problems running any of them.", "score": 4.0, "helpful_vote_statement": 3},
{"product_id": "B01N5G5PG2", "id": "R1KDQUDSO11K6F", "title": "Really good option for replacing older Kindle and IPAD.", "text": "Arrived with an older OS version on it so I had to upgrade the OS (using the auto update feature) before the PlayStore and Android Apps were accessible. I wanted this to replace an older IPAD and this is working out well.  Its fast, battery lasts for many hours, all the apps work well, the wifi on this is great, and the screen resolution is really great.", "score": 5.0, "helpful_vote_statement": 3},
{"product_id": "B01N5G5PG2", "id": "RV05HPDWP9I0W", "title": "Ergonomical keyboard, great battery life, light and full-featured", "text": "For the Battery, I've used it to watch ESPN for over four hours and the battery indicator it still had 5 hours of battery left.  For the apps, I'm using the same Andriod apps I use on my phone and they perform just as well: WatchESPN, CBS Sports, PSVue, News, Amazon Video, Netflix, XM Radio, HBONow, Showtime, etc.  The speed is far superior to Kindle and IPAD.", "score": 5.0, "helpful_vote_statement": 2},
{"product_id": "B01N5G5PG2", "id": "R1U8XD94ABN8B8", "title": "OpenVPN support needs more work", "text": "Sleek, great keyboard, convertible laptop with great battery life, nice display and Android app support after running a system update.", "score": 4.0, "helpful_vote_statement": 4},
{"product_id": "B01N5G5PG2", "id": "RU2TAKMDE25YD", "title": "Stops charging and becomes essentially useless.", "text": "I've always been a Windows laptop user because I needed certain applications like Word and Excel for work, but with ChromeOS and Android app support there's very little this machine can't do that I need it to do.", "score": 1.0, "helpful_vote_statement": 3},
{"product_id": "B01N5G5PG2", "id": "RLYCIJYSHI0YF", "title": "What I've been wanting for 2 years!", "text": "The only drawback to the device so far is that it's not especially comfortable to use in tablet mode; the edges of the bezel are little too \"sharp\" to comfortably rest your palms and at 2.4 lbs. Is noticably heavier than a true tablet. This isn't particularly a problem since I use it about 95% of the time in laptop mode.", "score": 5.0, "helpful_vote_statement": 3},
{"product_id": "B01N5G5PG2", "id": "R3JZVCJ1DWFY5C", "title": "A Good Computer Substitute for Older Folks ....Like Me", "text": "Bottom line: if you like the Android ecosystem and need a well-made, pleasing to use, laptop for word processing and web browsing, that can also function as a tablet in a pinch this might be just what you're looking for.", "score": 5.0, "helpful_vote_statement": 2},
{"product_id": "B01N5G5PG2", "id": "R3CIRJE06VF88S", "title": "Amazing Chromebook!", "text": "I'm not going to go into anything else since quite a few other folks have already written about everything, but wanted to go over what's been disappointing about using this ChromeBook.  OpenVPN support needs some serious work still.  When I read ChromeOS supported OpenVPN it was a done deal for me.  As an IT Manager, I use OpenVPN at home and at work.  I thought all I needed to do was import my .ovpn file and I would be all set, but that's definitely NOT the case.  Various instructions online tell you to break apart your ovpn file, or how to create and download the various ca, client and key files, then convert them, then import them, then etc. etc.  I've been doing this for a long time and I'll probably eventually get the right files and configuration in place to make that VPN connection, but I was a bit surprised how much it reminded me of the earlier VPN days (late 80s early 90s, I know I just dated myself) when it was a crap shoot and just like this to try to get VPN working.  I shouldn't really have to take 4 or 5 files and manipulate them and/or upload them to get this to work.", "score": 5.0, "helpful_vote_statement": 4},
{"product_id": "B01N5G5PG2", "id": "R1R8YVHM57FL9K", "title": "android an afterthought?", "text": "For now, at least I've got this ChromeBook in Beta mode and the OpenVPN Google App does work, but realize only Google Apps will communicate across this VPN connection.  The native Chrome browser will not, nor will any ChromeOS apps will communicate across this OpenVPN connection.  At least that was for my case.", "score": 4.0, "helpful_vote_statement": 3},
{"product_id": "B01N5G5PG2", "id": "R203XLF4VLUJ58", "title": "This chromebook is awesome. I avoided tablets for the longest time because ...", "text": "Don't get me wrong though, I love the battery life and 95% I'm happy chugging along, but every once in a while this rears it's ugly head.  I took a look at the ChromeOS feature requests and updates and it just seems like posts on this feature have gone stagnant so just realize you'll have to jump through some hoops to get this to work for at least the present and near future.  If I do get it to work i'll try to write up an in depth how to using the latest OpenVPN AS.", "score": 5.0, "helpful_vote_statement": 2},
{"product_id": "B01N5G5PG2", "id": "R10EL6JHI394P3", "title": "despite the great reviews i wanted to test it out in person ...", "text": "I originally purchased this at the beginning of April after about a week it stopped charging (would receive \"low power charger\" connected message and not charge). Tried the troubleshooting steps...hard reset (refresh+power), left it plugged in, left it unplugged, etc, but couldn't get it to charge. Tried the charger with other devices and it worked fine. I ended up returning it. I decided to try for another one, which I received towards the end of April. After about a week, ran into the same exact issue, and tried the same exact remedies as above (that have been recommended on here and elsewhere). Still wouldn't charge. And now this one is being returned. After reading through the comments I see that this issue is occurring for a lot of other people as well. Is this a known defect that ASUS refuses to acknowledge? I know that they have been replying to comments on here to send it in for repair but that almost seems like they knew this was going to be an issue and prepared themselves to receive numerous units to repair. Thankfully for both of these purchases I was still within the return period and was able to send back to Amazon (considering in both cases they stopped charging quickly). But that doesn't leave me with much confidence in ASUS and a highly rated Chromebook that was supposed to be \"one of the best\", especially when I found myself with the same issue on the same model...twice.", "score": 1.0, "helpful_vote_statement": 7},
{"product_id": "B01N5G5PG2", "id": "R3GU9CMZG5VXOL", "title": "You may still need a computer but not for much", "text": "Chromebooks take some getting used to, but, with this one, the journey has  been a smooth one.  I'm giving it four stars only because I have had it for just two months and I expect it to serve for three or more years.  I'll let you know how that goes.  I bought this mostly for traveling and having some control over what I watch on an airplane.  It's possible, given what sort of space you get on most flights these days, that it may be a little too big.  My main criterion for size was that it had to fit comfortably in the bag my son gave me and this does, a little better than my X230 think Pad did.  But, I wanted as big a screen as would fit and this Chromebook is great for that, much higher resolution than the think Pad and very crisp and bright (if you turn it up a lot).  It's still a little cumbersome when the guy in front of slams his seat back into your face,  but flipping it to tablet mode and setting it just to the side of the lap table, so there's still room for your drink, works.", "score": 4.0, "helpful_vote_statement": 0},
{"product_id": "B01N5G5PG2", "id": "R3GP8K2JDHVVDS", "title": "Nice but annoying you can't install typical droid apps... YET...", "text": "The coolest thing is the touch screen on something this size.  The only problem is that I'm already trying to touch the screen on other displays that just aren't there yet.  Depending on the resolution you choose, things can get pretty small and, where a mouse click would be nothing, your finger can have trouble.  I'm using one notch down from the ASUS recommended 1920x1080 and that makes touching the right spot and getting the desired response a little easier but I'm older than all computers and have to make accommodations that you might not.  I've been using a Bluetooth mouse and it works well but, it's still quicker to just reach out and press some button than to use the mouse.", "score": 3.0, "helpful_vote_statement": 3},
{"product_id": "B01N5G5PG2", "id": "R1XL6ZRRS5HJU1", "title": "GREAT portable device, powerful, sleek, light, and it's aluminum frame is fantastic.  Running latest version of ChromeOS", "text": "Another cool thing is that you can install many Android apps if you have a fairly recent release of the Chrome OS, which this one has and, I suspect, most Chromebooks will have soon  .  So far, Netflix has been the most useful for me.  They will let you download a subset of their movies so you can watch them offline.  You have to sign up for the streaming service ($12/mo., cancelable any time) and not using a normal computer. I select the standard resolution which, on this size screen, is fine and a typical movie takes less than a gigabyte.  If you have Amazon Prime, you can install their Android video app and download selected movies for no extra cost.  And then, watch them all anywhere with no network worries.", "score": 5.0, "helpful_vote_statement": 8},
{"product_id": "B01N5G5PG2", "id": "R1WV0XMD1O6UY6", "title": "A tremendous Chromebook in quality and performance at a great price.", "text": "You will wind up buying some adapters and attachments until the whole world is on USB  C and then you'll have to start getting adapters for whatever follows it  I have a USB C cable with micro-USB on the other end.  Then I can use one of the ASUS ports to charge a real phone, but not very fast. I also have a small box with three USB 3 ports and slots for both flavors of SD chips and a short cable that plugs into one of the USB C ports.  The ASUS has only two USB C ports but they are both the same and they do everything.", "score": 5.0, "helpful_vote_statement": 2},
{"product_id": "B01N5G5PG2", "id": "R22Q4Q2EUAJUZU", "title": "Tried to like it", "text": "Most current printers with wi-fi will connect to this Chromebook and it will connect to a google Cloud Printer, a real printer connected to a computer that's anywhere, presumably close enough to you to do some good.", "score": 3.0, "helpful_vote_statement": 0},
{"product_id": "B01N5G5PG2", "id": "R2BJ1U1CHYSWBY", "title": "Most Amazing Flip EVER!!!!", "text": "The ASUS C302 costs a little more than lots of 12.5 inch Chromebooks but it offers a lot more, quality, a good back-lit keyboard, a 64GB option, a tiny charger that still charges from empty to full in less than an hour, a micro-SD slot and the fantastic screen.", "score": 5.0, "helpful_vote_statement": 4},
{"product_id": "B01N5G5PG2", "id": "R1RY9CXBZCP6S9", "title": "Great performance, great keyboard, minor quality control issue", "text": "I like this thing a lot and I hope I don't leave it on some plane.", "score": 4.0, "helpful_vote_statement": 10},
{"product_id": "B01N5G5PG2", "id": "R16DJ30HHFBY7O", "title": "Amazing design for the money, a real game changer!", "text": "Excellent so far -- sort of.  Apparently Android has not release typical droid apps for its OS so when you install something, say, like Outlook, it tells you it will be installed shortly.  Which basically means when they release the correct patches.  Many apps won't download and work on it like they do on an Ellipsis.  There are curious workarounds that I think I will pass on -- one says to get into the coding channel Canary.  Another is installing all these proxy services.  Annoying.", "score": 5.0, "helpful_vote_statement": 3},
{"product_id": "B01N5G5PG2", "id": "R12S7NCRVVMY8J", "title": "Excellent \"betweener!\"", "text": "This is my first Chromebook.  As a Windows user since 3.x; moving to a Chromebook was a big deal.  I LOVE IT!!!!  I spent the extra money on a great name and build.  If you're looking for a good Chromebook, this is the one for you. It's running the newest Chrome OS with the Play Store.  I travel with this as my personal \"laptop\".  A fantastic product, with an aluminum frame, touchscreen, and high definition; high resolution screen; you can't beat this.  It's super thin and super light.  As a traveler, this fits in my backpack without all the added weight of a small 13\" laptop.  Everything I was looking for in a portable.  I highly recommend this if you're looking for a lightweight, high-performance portable device.  The M3 is great, never slow or laggy.  I mainly download movies over the Netflix app and watch movies on the airplane and internet browsing in hotel rooms.  As an IT guy for over 20+ years, I'm very impressed with this little unit.  It beats a Surface any day of the week. I don't spend hours every month downloading updates and rebooting.", "score": 5.0, "helpful_vote_statement": 3},
{"product_id": "B01N5G5PG2", "id": "R3GMPROFW4RYPF", "title": "Great computer -- but it's cracking!  Not so happy anymore.", "text": "This Chromebook is amazing. It is very fast and fluid and I have noticed no hiccups or issues with slowdown. It comes with Android apps available straight out of the box. My choices were this and a Samsung Chromebook Pro. I tested the Chromebook Pro at a local Best Buy and, although the scren quality was great, the keyboard was too packed together and led to many typing errors. This Chromebook features a full size keyboard and is easier type on by a long shot. It is also backlit which the Chromebook Pro is not. The screen is really amazing and you can easily change it to 1080p with no issues (it's set lower out of the box). It can even simulate 2K in the OS but the icons and text become almost too small to read or use. It has a very fast 64GB SSD and 4GB on LPDDR3 memory. The m3 processor (also available as m5 variant) is fast and easily handles anything I throw at it. It is a fanless processor so there are no vents or openings of any kind which makes this exceptionally quiet as well. The touchscreen is very responsive and works great in tablet mode. The device is very light and easily transportable. The battery life is touted as 10 hours but I find that 7.5 to 8 is more realistic. The design of the device also sets it apart. It is better looking than most other Chromebooks an looks very much like a MacBook air or a small MacBook Pro. Overall, this is one of , if not, the best devices I've used including Windows and Mac computers. I highly recommend overall.Happy to answer any questions that wasn't covered in this review.", "score": 1.0, "helpful_vote_statement": 3},
{"product_id": "B01N5G5PG2", "id": "R2NROG2K1Q49DB", "title": "Get one. Just get one. It's worth it.", "text": "This is the best tech purchase I have made since getting a smartphone in 2008. I can't recommend the Asus C302 enough. I can't put it down.", "score": 5.0, "helpful_vote_statement": 0},
{"product_id": "B01N5G5PG2", "id": "RCRMSK5H9U9N2", "title": "Love this Chromebook!", "text": "I shop on it. I socialize on it. I am productive on it. I game on it. I listen to music on it. I watch movies on it. I do research on it. There is nothing I can't do on this amazing thing.", "score": 5.0, "helpful_vote_statement": 2},
{"product_id": "B01N5G5PG2", "id": "RHGIN3FQ50GIZ", "title": "The pricing was too good to pass up and I've really been pleased with ...", "text": "Battery life is good. Screen looks great. Touch pad is A++. Sound is.... well it's as good as any laptop speaker system. Never slows down. No glitches, no bugs. It's lightweight, sleek, and sexy as hell. It's durable. No screen wobble while tying. Keyboard is the best laptop keyboard I have ever used. It's sized about the same as the most popular macbooks so it's easy to find accessories for it like bags and sleeves.", "score": 5.0, "helpful_vote_statement": 0},
{"product_id": "B01N5G5PG2", "id": "R2TNTFQK6QDJ9K", "title": "Completely Satisfied", "text": "It really is an amazing piece of tech and I am so happy I got one.", "score": 5.0, "helpful_vote_statement": 4},
{"product_id": "B01N5G5PG2", "id": "R55ZLKNUBAY65", "title": "Slick, solid Chromebook. It just works.", "text": "This was my first Chromebook purchase as I was switching over from an expensive Macbook Pro. Setup was fast and easy, but then again I've been a gmail/gcal/gdocs purist for a while now. The Chromebook loads everything lightning fast and provides a simple user experience that gets you where you need to go quickly and efficiently. The computer itself is sturdy and feels well-made, though the keyboard is a bit smaller than I'm used to. I sometimes have trouble getting the spacebar to fire properly. I haven't used the tablet mode much, but could imagine it being good for playing games, watching video (the speakers aren't great but that's not surprising), etc. I have used it as a convenient way to pull up a recipe and review while I'm cooking though!", "score": 5.0, "helpful_vote_statement": 2},
{"product_id": "B01N5G5PG2", "id": "R12S1E5N7CXSNO", "title": "Amazing Chromebook", "text": "Overall this was a good purchase and worth the money. Would recommend for anyone who's making a switch to a Chromebook and has fairly light computing needs.", "score": 5.0, "helpful_vote_statement": 3},
{"product_id": "B01N5G5PG2", "id": "RDONK84OT3SWN", "title": "A good choice among Chromebooks", "text": "I've been waiting to pull the trigger on a Chromebook and this came available in Warehouse Deals. The pricing was too good to pass up and I've really been pleased with the product. It has exceeded my expectations for performance, functionality and utility. Asus has done a good job with the look and feel of the C302CA and the build quality approaches that of a much more expensive device. I use the Chromebook as my travel device - it replaces my Dell Laptop and Nexus tablet while I'm on the road. It's  not the greatest form factor for a tablet, but I only use it as a book reader and it works fine for that. I have yet to find anything that I can't do on the Chromebook that I could on the laptop with the exception of Visio drawings and I'm looking for a solution there (not really a major concern and I'm actually trying Remote Desktop extension for Chrome as a temporary fix). The shift away from \"everything on the device\" to \"everything in the cloud\" does take a bit of getting used to for us \"Old Tech Heads\" but it's the way everything is evolving and  this device is a perfect first foray for me.", "score": 5.0, "helpful_vote_statement": 0},
{"product_id": "B01N5G5PG2", "id": "R1NRR5CY6H5ZVD", "title": "A sweet little Chromebook that has limited support for Windows and Android software.", "text": "I bought the Asus Chromebook Flip 302CA for my wife for Mother's Day to upgrade her from a 4 year old HP Chromebook. The Asus Chromebook Flip 302CA is smooth, fast and incredibly well engineered and built. Super slim metal housing, yet still fairly lightweight. I've found the large trackpad to be responsive and accurate. Backlit keyboard is extremely viewable and comfortable. Super easy first time setup. All apps ported automatically from the old HP Chromebook via my wife's G-mail account. She loves this laptop. I also have the Asus Flip C100, a prior model, which I love. However, this new model Flip C302 far surpasses the C100 in terms of design and performance.", "score": 5.0, "helpful_vote_statement": 3}
][
{"product_id": "B077PQ1VNY", "id": "R2CP3D0TB3AKD1", "title": "It is very user friendly, where there touch screen ...", "text": "It is  very user friendly, where there touch screen makes life a bit more easier. It's to rage and processing speed is idealy what I needed. I must say that it satisfies all my expectations.", "score": 5.0, "helpful_vote_statement": 3},
{"product_id": "B077PQ1VNY", "id": "R2AMX0DY92S5X6", "title": "Five Stars", "text": "Was exactly what I was looking for.", "score": 5.0, "helpful_vote_statement": 3},
{"product_id": "B077PQ1VNY", "id": "RJR6IK0LBJMC9", "title": "Sucks!!", "text": "This computer sucks!! It’s so slow and freezes all the time. I don’t suggest buying it.", "score": 1.0, "helpful_vote_statement": 2},
{"product_id": "B077PQ1VNY", "id": "R3QZH3IHT473MM", "title": "Easy to navigate", "text": "I was surprise this laptop came with the software needed.  Easy to navigate, price was right.  Laptop is excellent for beginners.  User friendly.", "score": 5.0, "helpful_vote_statement": 2},
{"product_id": "B077PQ1VNY", "id": "R3852EJAXD63MO", "title": "Buy it", "text": "It slow but I love it", "score": 5.0, "helpful_vote_statement": 2},
{"product_id": "B077PQ1VNY", "id": "R3D8GCD5IZK8ZJ", "title": "Too good to be true, cheap but slow", "text": "Way too slow, I should have read the reviews more closely. I can’t believe a computer could be this slow, at least not a new one. HP fails again. Other than the slow speed, everything appears to function.", "score": 2.0, "helpful_vote_statement": 0},
{"product_id": "B077PQ1VNY", "id": "R3CEGYSX16U6TD", "title": "At first I was disappointed how sluggish it was", "text": "I got this laptop about a week ago. At first I was disappointed how sluggish it was, I discovered that after I removed the mcafee security, it ran more smoothly!!", "score": 4.0, "helpful_vote_statement": 2},
{"product_id": "B077PQ1VNY", "id": "R2U9995S19KEG6", "title": "I HAD TO GET A MOUSE TO BETTER SERVE MY NEEDS", "text": "MY FIRST LAPTOP - I'M IMPRESSED WITH SCREEN CLARITY & FUNCTIONS THAT IT HAS. STILL LEARNING ALL THE FEATURES IT HAS TO OFFER, I HAD TO GET A MOUSE TO BETTER SERVE MY NEEDS. BUT WORKS FAST & GREAT FOR ME NOW. I LIKE IT.", "score": 4.0, "helpful_vote_statement": 2},
{"product_id": "B077PQ1VNY", "id": "R3U6QT49BIMVY0", "title": "Five Stars", "text": "😍", "score": 5.0, "helpful_vote_statement": 2},
{"product_id": "B077PQ1VNY", "id": "RXM10RNZ3FJ9X", "title": "Liked the price most", "text": "Liked the price most, but it is slower than I thought it would be and it has been difficult to access wireless printers. Meets most basic needs, but I will spend more next time for a higher end machine.  First time buying a computer on line.", "score": 3.0, "helpful_vote_statement": 2}
][
{"product_id": "B077PQ1VNY", "id": "R2CP3D0TB3AKD1", "title": "It is very user friendly, where there touch screen ...", "text": "It is  very user friendly, where there touch screen makes life a bit more easier. It's to rage and processing speed is idealy what I needed. I must say that it satisfies all my expectations.", "score": 5.0, "helpful_vote_statement": 3},
{"product_id": "B077PQ1VNY", "id": "R2AMX0DY92S5X6", "title": "Five Stars", "text": "Was exactly what I was looking for.", "score": 5.0, "helpful_vote_statement": 3},
{"product_id": "B077PQ1VNY", "id": "RJR6IK0LBJMC9", "title": "Sucks!!", "text": "This computer sucks!! It’s so slow and freezes all the time. I don’t suggest buying it.", "score": 1.0, "helpful_vote_statement": 2},
{"product_id": "B077PQ1VNY", "id": "R3QZH3IHT473MM", "title": "Easy to navigate", "text": "I was surprise this laptop came with the software needed.  Easy to navigate, price was right.  Laptop is excellent for beginners.  User friendly.", "score": 5.0, "helpful_vote_statement": 2},
{"product_id": "B077PQ1VNY", "id": "R3852EJAXD63MO", "title": "Buy it", "text": "It slow but I love it", "score": 5.0, "helpful_vote_statement": 2},
{"product_id": "B077PQ1VNY", "id": "R3D8GCD5IZK8ZJ", "title": "Too good to be true, cheap but slow", "text": "Way too slow, I should have read the reviews more closely. I can’t believe a computer could be this slow, at least not a new one. HP fails again. Other than the slow speed, everything appears to function.", "score": 2.0, "helpful_vote_statement": 0},
{"product_id": "B077PQ1VNY", "id": "R3CEGYSX16U6TD", "title": "At first I was disappointed how sluggish it was", "text": "I got this laptop about a week ago. At first I was disappointed how sluggish it was, I discovered that after I removed the mcafee security, it ran more smoothly!!", "score": 4.0, "helpful_vote_statement": 2},
{"product_id": "B077PQ1VNY", "id": "R2U9995S19KEG6", "title": "I HAD TO GET A MOUSE TO BETTER SERVE MY NEEDS", "text": "MY FIRST LAPTOP - I'M IMPRESSED WITH SCREEN CLARITY & FUNCTIONS THAT IT HAS. STILL LEARNING ALL THE FEATURES IT HAS TO OFFER, I HAD TO GET A MOUSE TO BETTER SERVE MY NEEDS. BUT WORKS FAST & GREAT FOR ME NOW. I LIKE IT.", "score": 4.0, "helpful_vote_statement": 2},
{"product_id": "B077PQ1VNY", "id": "R3U6QT49BIMVY0", "title": "Five Stars", "text": "😍", "score": 5.0, "helpful_vote_statement": 2},
{"product_id": "B077PQ1VNY", "id": "RXM10RNZ3FJ9X", "title": "Liked the price most", "text": "Liked the price most, but it is slower than I thought it would be and it has been difficult to access wireless printers. Meets most basic needs, but I will spend more next time for a higher end machine.  First time buying a computer on line.", "score": 3.0, "helpful_vote_statement": 2}
][
{"product_id": "B077PQ1VNY", "id": "R2CP3D0TB3AKD1", "title": "It is very user friendly, where there touch screen ...", "text": "It is  very user friendly, where there touch screen makes life a bit more easier. It's to rage and processing speed is idealy what I needed. I must say that it satisfies all my expectations.", "score": 5.0, "helpful_vote_statement": 3},
{"product_id": "B077PQ1VNY", "id": "R2AMX0DY92S5X6", "title": "Five Stars", "text": "Was exactly what I was looking for.", "score": 5.0, "helpful_vote_statement": 3},
{"product_id": "B077PQ1VNY", "id": "RJR6IK0LBJMC9", "title": "Sucks!!", "text": "This computer sucks!! It’s so slow and freezes all the time. I don’t suggest buying it.", "score": 1.0, "helpful_vote_statement": 2},
{"product_id": "B077PQ1VNY", "id": "R3QZH3IHT473MM", "title": "Easy to navigate", "text": "I was surprise this laptop came with the software needed.  Easy to navigate, price was right.  Laptop is excellent for beginners.  User friendly.", "score": 5.0, "helpful_vote_statement": 2},
{"product_id": "B077PQ1VNY", "id": "R3852EJAXD63MO", "title": "Buy it", "text": "It slow but I love it", "score": 5.0, "helpful_vote_statement": 2},
{"product_id": "B077PQ1VNY", "id": "R3D8GCD5IZK8ZJ", "title": "Too good to be true, cheap but slow", "text": "Way too slow, I should have read the reviews more closely. I can’t believe a computer could be this slow, at least not a new one. HP fails again. Other than the slow speed, everything appears to function.", "score": 2.0, "helpful_vote_statement": 0},
{"product_id": "B077PQ1VNY", "id": "R3CEGYSX16U6TD", "title": "At first I was disappointed how sluggish it was", "text": "I got this laptop about a week ago. At first I was disappointed how sluggish it was, I discovered that after I removed the mcafee security, it ran more smoothly!!", "score": 4.0, "helpful_vote_statement": 2},
{"product_id": "B077PQ1VNY", "id": "R2U9995S19KEG6", "title": "I HAD TO GET A MOUSE TO BETTER SERVE MY NEEDS", "text": "MY FIRST LAPTOP - I'M IMPRESSED WITH SCREEN CLARITY & FUNCTIONS THAT IT HAS. STILL LEARNING ALL THE FEATURES IT HAS TO OFFER, I HAD TO GET A MOUSE TO BETTER SERVE MY NEEDS. BUT WORKS FAST & GREAT FOR ME NOW. I LIKE IT.", "score": 4.0, "helpful_vote_statement": 2},
{"product_id": "B077PQ1VNY", "id": "R3U6QT49BIMVY0", "title": "Five Stars", "text": "😍", "score": 5.0, "helpful_vote_statement": 2},
{"product_id": "B077PQ1VNY", "id": "RXM10RNZ3FJ9X", "title": "Liked the price most", "text": "Liked the price most, but it is slower than I thought it would be and it has been difficult to access wireless printers. Meets most basic needs, but I will spend more next time for a higher end machine.  First time buying a computer on line.", "score": 3.0, "helpful_vote_statement": 2}
][
{"product_id": "B077PQ1VNY", "id": "R23HPWD7DJX2NI", "title": "Do not buy!!", "text": "I don’t know why you can’t put zero stars but this computer is a piece of junk. We had it 12 hours, 8 of those were overnight and it stopped working. I spent an hour with customer support. The keyboard just stopped working. Please do not buy it. Plus it came with the price tag on it and it was $249. I paid 326$", "score": 1.0},
{"product_id": "B077PQ1VNY", "id": "R187RC6QEKPQQ5", "title": "Do not order from maze tech", "text": "I ordered a new version of this laptop and received a used one that had not even been reformatted. It popped right up to the previous owner's picture and log in. On top of that, the keyboard does not work.", "score": 1.0},
{"product_id": "B077PQ1VNY", "id": "R1LZ5J3IU9LLBZ", "title": "Five Stars", "text": "My niece loves it She loves that she can touch the screen", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "R3RC38LAGXQ5RT", "title": "The unit that arrived was faulty. It could not ...", "text": "The unit that arrived was faulty.  It could not find my home network and saw nothing but the HP printer sitting beside it.  My previous computer saw not only my home network but about six in the neighborhood besides.  I fooled with it for longer than I should have spent on it and returned it.", "score": 1.0},
{"product_id": "B077PQ1VNY", "id": "R3LJFSVNX9HRUD", "title": "Husband is very happy. Enjoys the touch screen the most", "text": "Husband is very happy.  Enjoys the touch screen the most.", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "R22J653PBGDZV3", "title": "Great for school", "text": "I am very pleased with this laptop.  I purchased it because I’m taking classes for Pharmacy Technician and it is exactly what I need.  Not a lot of bells and whistles; just the basics. I love that it’s touchscreen too!  And that’s perfect for me!", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "R2KWHYRKRIRUI5", "title": "Four Stars", "text": "It works great no problem so far other than a clicking sound", "score": 4.0},
{"product_id": "B077PQ1VNY", "id": "R223DAYKQYPU5G", "title": "I thought it was beautiful the screen was so bright and clear", "text": "My note is a cry for help..I ordered this computer back in January here it is May and I have not been able to use it...I ordered it because it has a disk drive and my old one does not and here I am on my old one...I am 85 years and not real computer literate....When it first came I was so excited, I thought it was beautiful the screen was so bright and clear, and it let you know if the cap lock was on, something my old on did not and had me quite frustrated at times...Well to get back to the beginning I answered all the questions then it said the wanted my password it did not make sense to me since I had just received it and had not given it a password but I entered every password I could think of then it rejected every one then proceeded to shut me out...It keeps saying to go to this site on computed but I cannot get into the computer.  My children both looked at it but don't know what to do they say send it back but I have already threw away the wrapping I don't see how I can afford to go to repair shop and if  don't know it's secret  password how would they....What do all of you out in computer land advise me to do Joanne Price", "score": 1.0},
{"product_id": "B077PQ1VNY", "id": "R3T7E32APMSIF7", "title": "Four Stars", "text": "Works for me, the battery is not quite there yet but charges real fast.", "score": 4.0},
{"product_id": "B077PQ1VNY", "id": "R142AVVWP7LW7R", "title": "Don’t buy. Slowest computer", "text": "I finally got around to setting this computer up, and I don’t know if I got a refurbished computer or what, but it barely works. It takes FOREVER to start up and even longer to access internet, Microsoft word, anything. Pop ups all over the place, and not even when I’m on the internet. I wish there was a way to return it but unfortunately I can’t find that option. It’s just awful.", "score": 1.0},
{"product_id": "B077PQ1VNY", "id": "R2CP3D0TB3AKD1", "title": "It is very user friendly, where there touch screen ...", "text": "It is  very user friendly, where there touch screen makes life a bit more easier. It's to rage and processing speed is idealy what I needed. I must say that it satisfies all my expectations.", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "R2AMX0DY92S5X6", "title": "Five Stars", "text": "Was exactly what I was looking for.", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "RJR6IK0LBJMC9", "title": "Sucks!!", "text": "This computer sucks!! It’s so slow and freezes all the time. I don’t suggest buying it.", "score": 1.0},
{"product_id": "B077PQ1VNY", "id": "R3QZH3IHT473MM", "title": "Easy to navigate", "text": "I was surprise this laptop came with the software needed.  Easy to navigate, price was right.  Laptop is excellent for beginners.  User friendly.", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "R3852EJAXD63MO", "title": "Buy it", "text": "It slow but I love it", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "R3D8GCD5IZK8ZJ", "title": "Too good to be true, cheap but slow", "text": "Way too slow, I should have read the reviews more closely. I can’t believe a computer could be this slow, at least not a new one. HP fails again. Other than the slow speed, everything appears to function.", "score": 2.0},
{"product_id": "B077PQ1VNY", "id": "R3CEGYSX16U6TD", "title": "At first I was disappointed how sluggish it was", "text": "I got this laptop about a week ago. At first I was disappointed how sluggish it was, I discovered that after I removed the mcafee security, it ran more smoothly!!", "score": 4.0},
{"product_id": "B077PQ1VNY", "id": "R2U9995S19KEG6", "title": "I HAD TO GET A MOUSE TO BETTER SERVE MY NEEDS", "text": "MY FIRST LAPTOP - I'M IMPRESSED WITH SCREEN CLARITY & FUNCTIONS THAT IT HAS. STILL LEARNING ALL THE FEATURES IT HAS TO OFFER, I HAD TO GET A MOUSE TO BETTER SERVE MY NEEDS. BUT WORKS FAST & GREAT FOR ME NOW. I LIKE IT.", "score": 4.0},
{"product_id": "B077PQ1VNY", "id": "R3U6QT49BIMVY0", "title": "Five Stars", "text": "😍", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "RXM10RNZ3FJ9X", "title": "Liked the price most", "text": "Liked the price most, but it is slower than I thought it would be and it has been difficult to access wireless printers. Meets most basic needs, but I will spend more next time for a higher end machine.  First time buying a computer on line.", "score": 3.0},
{"product_id": "B06WD61CF5", "id": "R2N5SZKZM5S2FH", "title": "Fast boot up.", "text": "So far so good.  Boots up super quick, and shuts down super quick.  No complaints so far about anything.", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R3HXYJA91C5OCE", "title": "Acer Aspire", "text": "Fast, great looking, great investment.", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "RDBJI6658C6MY", "title": "material under case of laptop is so bad and it peeled off", "text": "I got so many problem with this laptop in 8 months.  I sent it to repair service one time. Now, Touch screen does not work and I have to sent to it to repair. Also,  material under case of laptop is so bad and it  peeled off.", "score": 2.0},
{"product_id": "B06WD61CF5", "id": "R23CAM5LOP6YYC", "title": "it's leagues better than the Alienware it replaced (mind you that one ...", "text": "I live this laptop with all my heart, it's leagues better than the Alienware it replaced (mind you that one was 6 yrs old) and it suits my diverse lifestyle, just wish it had more storage space", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "RIEBD7W2R7G7G", "title": "Five Stars", "text": "It's great", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "RGBW2FVXOKGBG", "title": "Five Stars", "text": "GOOD", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R1KMVJ9PG9APGR", "title": "Great machine.", "text": "It is delightful. Works well, slim, pretty, and pleasant to use.", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R3I62935CTYD2A", "title": "Five Stars", "text": "Works great!", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "RC649E2DYZRVC", "title": "Lightweight, good touchscreen, large display.", "text": "Seems to work OK. Lightweight, good touchscreen, large display. OK CPU.", "score": 3.0},
{"product_id": "B06WD61CF5", "id": "R2LYH914JG25UU", "title": "Great laptop! Surprisingly", "text": "Great laptop! Surprisingly, this laptop is great for gaming, work and browsing. It can handle games like Fortnite and Overwatch with ease.", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R1L5E4HDOO8KXN", "title": "Works great. I bought it at black friday so the ...", "text": "Works great. I bought it at black friday so the price / quality balance back then saved me the time to think much about it.", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R3TSVYJFWYAK5O", "title": "Very user friendly.", "text": "Fold it anyway you like it.  Cool capabilities.", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R14ZYVENDMDY6S", "title": "Five Stars", "text": "great product", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R3DTRM1VUDU1XT", "title": "Great product", "text": "I liked it so much i order another one at full price the first i got on black Friday.. Didn't like that one so much. Was DOA I did a return and never even seen as much as an acknowledgment that they received it .Which they did as i checked with UPS. I was told by Amazon as soon as they scanned it i would get either my money back or a new convertible laptop. I still give it 5 stars cause this thing rocks . Ive never been more satisfied with a computer,and In have had quite a few even built a few. i highly recommend this product.Amazon is the one that's lacking here.hope they wake up.", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R1W72DMSLK1Z3Y", "title": "Three Stars", "text": "Battery life is poor. Good overall laptop", "score": 3.0},
{"product_id": "B06WD61CF5", "id": "RS7KP4UVKU8S9", "title": "I really loved it.", "text": "This is a very fast and accurate machine.  I really loved it.", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R1DQ37EN6EG7BN", "title": "It's the best. No complaints", "text": "I mean, I'm using it to write this review. It's the best. No complaints.", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R209PO4KI279UB", "title": "Speedy laptop, almost flawless.", "text": "Love this speedy laptop that can double as a large tab. The i7 is much quicker than my previous laptop that had an i5. The tent feature will allow us to use this rather than our 10\" tablet when going on vacation on planes. The only negative is the fingerprint. Using the fingerprint to unlock my phone is second nature now and reads the print instantly. The Acer Aspire fingerprint sensor is honestly a waste of space. You're lucky if it reads your print 1 out of 10 tries. I've even been able to setup the same finger multiple times which shows it cannot read one fingerprint accurately. Still doesn't work.", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R1BUNUSVT8037D", "title": "Four Stars", "text": "Nice wide screen. Coming from a chromebook windows is hard to get use too.", "score": 4.0},
{"product_id": "B06WD61CF5", "id": "R14F76F1OVMIYU", "title": "Thumbs up!", "text": "Great laptop. Very sturdy, easy to use, fast.", "score": 5.0}
][
{"product_id": "B077PQ1VNY", "id": "R23HPWD7DJX2NI", "title": "Do not buy!!", "text": "I don’t know why you can’t put zero stars but this computer is a piece of junk. We had it 12 hours, 8 of those were overnight and it stopped working. I spent an hour with customer support. The keyboard just stopped working. Please do not buy it. Plus it came with the price tag on it and it was $249. I paid 326$", "score": 1.0},
{"product_id": "B077PQ1VNY", "id": "R187RC6QEKPQQ5", "title": "Do not order from maze tech", "text": "I ordered a new version of this laptop and received a used one that had not even been reformatted. It popped right up to the previous owner's picture and log in. On top of that, the keyboard does not work.", "score": 1.0},
{"product_id": "B077PQ1VNY", "id": "R1LZ5J3IU9LLBZ", "title": "Five Stars", "text": "My niece loves it She loves that she can touch the screen", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "R3RC38LAGXQ5RT", "title": "The unit that arrived was faulty. It could not ...", "text": "The unit that arrived was faulty.  It could not find my home network and saw nothing but the HP printer sitting beside it.  My previous computer saw not only my home network but about six in the neighborhood besides.  I fooled with it for longer than I should have spent on it and returned it.", "score": 1.0},
{"product_id": "B077PQ1VNY", "id": "R3LJFSVNX9HRUD", "title": "Husband is very happy. Enjoys the touch screen the most", "text": "Husband is very happy.  Enjoys the touch screen the most.", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "R22J653PBGDZV3", "title": "Great for school", "text": "I am very pleased with this laptop.  I purchased it because I’m taking classes for Pharmacy Technician and it is exactly what I need.  Not a lot of bells and whistles; just the basics. I love that it’s touchscreen too!  And that’s perfect for me!", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "R2KWHYRKRIRUI5", "title": "Four Stars", "text": "It works great no problem so far other than a clicking sound", "score": 4.0},
{"product_id": "B077PQ1VNY", "id": "R223DAYKQYPU5G", "title": "I thought it was beautiful the screen was so bright and clear", "text": "My note is a cry for help..I ordered this computer back in January here it is May and I have not been able to use it...I ordered it because it has a disk drive and my old one does not and here I am on my old one...I am 85 years and not real computer literate....When it first came I was so excited, I thought it was beautiful the screen was so bright and clear, and it let you know if the cap lock was on, something my old on did not and had me quite frustrated at times...Well to get back to the beginning I answered all the questions then it said the wanted my password it did not make sense to me since I had just received it and had not given it a password but I entered every password I could think of then it rejected every one then proceeded to shut me out...It keeps saying to go to this site on computed but I cannot get into the computer.  My children both looked at it but don't know what to do they say send it back but I have already threw away the wrapping I don't see how I can afford to go to repair shop and if  don't know it's secret  password how would they....What do all of you out in computer land advise me to do Joanne Price", "score": 1.0},
{"product_id": "B077PQ1VNY", "id": "R3T7E32APMSIF7", "title": "Four Stars", "text": "Works for me, the battery is not quite there yet but charges real fast.", "score": 4.0},
{"product_id": "B077PQ1VNY", "id": "R142AVVWP7LW7R", "title": "Don’t buy. Slowest computer", "text": "I finally got around to setting this computer up, and I don’t know if I got a refurbished computer or what, but it barely works. It takes FOREVER to start up and even longer to access internet, Microsoft word, anything. Pop ups all over the place, and not even when I’m on the internet. I wish there was a way to return it but unfortunately I can’t find that option. It’s just awful.", "score": 1.0},
{"product_id": "B077PQ1VNY", "id": "R2CP3D0TB3AKD1", "title": "It is very user friendly, where there touch screen ...", "text": "It is  very user friendly, where there touch screen makes life a bit more easier. It's to rage and processing speed is idealy what I needed. I must say that it satisfies all my expectations.", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "R2AMX0DY92S5X6", "title": "Five Stars", "text": "Was exactly what I was looking for.", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "RJR6IK0LBJMC9", "title": "Sucks!!", "text": "This computer sucks!! It’s so slow and freezes all the time. I don’t suggest buying it.", "score": 1.0},
{"product_id": "B077PQ1VNY", "id": "R3QZH3IHT473MM", "title": "Easy to navigate", "text": "I was surprise this laptop came with the software needed.  Easy to navigate, price was right.  Laptop is excellent for beginners.  User friendly.", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "R3852EJAXD63MO", "title": "Buy it", "text": "It slow but I love it", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "R3D8GCD5IZK8ZJ", "title": "Too good to be true, cheap but slow", "text": "Way too slow, I should have read the reviews more closely. I can’t believe a computer could be this slow, at least not a new one. HP fails again. Other than the slow speed, everything appears to function.", "score": 2.0},
{"product_id": "B077PQ1VNY", "id": "R3CEGYSX16U6TD", "title": "At first I was disappointed how sluggish it was", "text": "I got this laptop about a week ago. At first I was disappointed how sluggish it was, I discovered that after I removed the mcafee security, it ran more smoothly!!", "score": 4.0},
{"product_id": "B077PQ1VNY", "id": "R2U9995S19KEG6", "title": "I HAD TO GET A MOUSE TO BETTER SERVE MY NEEDS", "text": "MY FIRST LAPTOP - I'M IMPRESSED WITH SCREEN CLARITY & FUNCTIONS THAT IT HAS. STILL LEARNING ALL THE FEATURES IT HAS TO OFFER, I HAD TO GET A MOUSE TO BETTER SERVE MY NEEDS. BUT WORKS FAST & GREAT FOR ME NOW. I LIKE IT.", "score": 4.0},
{"product_id": "B077PQ1VNY", "id": "R3U6QT49BIMVY0", "title": "Five Stars", "text": "😍", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "RXM10RNZ3FJ9X", "title": "Liked the price most", "text": "Liked the price most, but it is slower than I thought it would be and it has been difficult to access wireless printers. Meets most basic needs, but I will spend more next time for a higher end machine.  First time buying a computer on line.", "score": 3.0},
{"product_id": "B06WD61CF5", "id": "R2N5SZKZM5S2FH", "title": "Fast boot up.", "text": "So far so good.  Boots up super quick, and shuts down super quick.  No complaints so far about anything.", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R3HXYJA91C5OCE", "title": "Acer Aspire", "text": "Fast, great looking, great investment.", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "RDBJI6658C6MY", "title": "material under case of laptop is so bad and it peeled off", "text": "I got so many problem with this laptop in 8 months.  I sent it to repair service one time. Now, Touch screen does not work and I have to sent to it to repair. Also,  material under case of laptop is so bad and it  peeled off.", "score": 2.0},
{"product_id": "B06WD61CF5", "id": "R23CAM5LOP6YYC", "title": "it's leagues better than the Alienware it replaced (mind you that one ...", "text": "I live this laptop with all my heart, it's leagues better than the Alienware it replaced (mind you that one was 6 yrs old) and it suits my diverse lifestyle, just wish it had more storage space", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "RIEBD7W2R7G7G", "title": "Five Stars", "text": "It's great", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "RGBW2FVXOKGBG", "title": "Five Stars", "text": "GOOD", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R1KMVJ9PG9APGR", "title": "Great machine.", "text": "It is delightful. Works well, slim, pretty, and pleasant to use.", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R3I62935CTYD2A", "title": "Five Stars", "text": "Works great!", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "RC649E2DYZRVC", "title": "Lightweight, good touchscreen, large display.", "text": "Seems to work OK. Lightweight, good touchscreen, large display. OK CPU.", "score": 3.0},
{"product_id": "B06WD61CF5", "id": "R2LYH914JG25UU", "title": "Great laptop! Surprisingly", "text": "Great laptop! Surprisingly, this laptop is great for gaming, work and browsing. It can handle games like Fortnite and Overwatch with ease.", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R1L5E4HDOO8KXN", "title": "Works great. I bought it at black friday so the ...", "text": "Works great. I bought it at black friday so the price / quality balance back then saved me the time to think much about it.", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R3TSVYJFWYAK5O", "title": "Very user friendly.", "text": "Fold it anyway you like it.  Cool capabilities.", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R14ZYVENDMDY6S", "title": "Five Stars", "text": "great product", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R3DTRM1VUDU1XT", "title": "Great product", "text": "I liked it so much i order another one at full price the first i got on black Friday.. Didn't like that one so much. Was DOA I did a return and never even seen as much as an acknowledgment that they received it .Which they did as i checked with UPS. I was told by Amazon as soon as they scanned it i would get either my money back or a new convertible laptop. I still give it 5 stars cause this thing rocks . Ive never been more satisfied with a computer,and In have had quite a few even built a few. i highly recommend this product.Amazon is the one that's lacking here.hope they wake up.", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R1W72DMSLK1Z3Y", "title": "Three Stars", "text": "Battery life is poor. Good overall laptop", "score": 3.0},
{"product_id": "B06WD61CF5", "id": "RS7KP4UVKU8S9", "title": "I really loved it.", "text": "This is a very fast and accurate machine.  I really loved it.", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R1DQ37EN6EG7BN", "title": "It's the best. No complaints", "text": "I mean, I'm using it to write this review. It's the best. No complaints.", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R209PO4KI279UB", "title": "Speedy laptop, almost flawless.", "text": "Love this speedy laptop that can double as a large tab. The i7 is much quicker than my previous laptop that had an i5. The tent feature will allow us to use this rather than our 10\" tablet when going on vacation on planes. The only negative is the fingerprint. Using the fingerprint to unlock my phone is second nature now and reads the print instantly. The Acer Aspire fingerprint sensor is honestly a waste of space. You're lucky if it reads your print 1 out of 10 tries. I've even been able to setup the same finger multiple times which shows it cannot read one fingerprint accurately. Still doesn't work.", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R1BUNUSVT8037D", "title": "Four Stars", "text": "Nice wide screen. Coming from a chromebook windows is hard to get use too.", "score": 4.0},
{"product_id": "B06WD61CF5", "id": "R14F76F1OVMIYU", "title": "Thumbs up!", "text": "Great laptop. Very sturdy, easy to use, fast.", "score": 5.0}
][
{"product_id": "B077PQ1VNY", "id": "R23HPWD7DJX2NI", "title": "Do not buy!!", "text": "I don’t know why you can’t put zero stars but this computer is a piece of junk. We had it 12 hours, 8 of those were overnight and it stopped working. I spent an hour with customer support. The keyboard just stopped working. Please do not buy it. Plus it came with the price tag on it and it was $249. I paid 326$", "score": 1.0},
{"product_id": "B077PQ1VNY", "id": "R187RC6QEKPQQ5", "title": "Do not order from maze tech", "text": "I ordered a new version of this laptop and received a used one that had not even been reformatted. It popped right up to the previous owner's picture and log in. On top of that, the keyboard does not work.", "score": 1.0},
{"product_id": "B077PQ1VNY", "id": "R1LZ5J3IU9LLBZ", "title": "Five Stars", "text": "My niece loves it She loves that she can touch the screen", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "R3RC38LAGXQ5RT", "title": "The unit that arrived was faulty. It could not ...", "text": "The unit that arrived was faulty.  It could not find my home network and saw nothing but the HP printer sitting beside it.  My previous computer saw not only my home network but about six in the neighborhood besides.  I fooled with it for longer than I should have spent on it and returned it.", "score": 1.0},
{"product_id": "B077PQ1VNY", "id": "R3LJFSVNX9HRUD", "title": "Husband is very happy. Enjoys the touch screen the most", "text": "Husband is very happy.  Enjoys the touch screen the most.", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "R22J653PBGDZV3", "title": "Great for school", "text": "I am very pleased with this laptop.  I purchased it because I’m taking classes for Pharmacy Technician and it is exactly what I need.  Not a lot of bells and whistles; just the basics. I love that it’s touchscreen too!  And that’s perfect for me!", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "R2KWHYRKRIRUI5", "title": "Four Stars", "text": "It works great no problem so far other than a clicking sound", "score": 4.0},
{"product_id": "B077PQ1VNY", "id": "R223DAYKQYPU5G", "title": "I thought it was beautiful the screen was so bright and clear", "text": "My note is a cry for help..I ordered this computer back in January here it is May and I have not been able to use it...I ordered it because it has a disk drive and my old one does not and here I am on my old one...I am 85 years and not real computer literate....When it first came I was so excited, I thought it was beautiful the screen was so bright and clear, and it let you know if the cap lock was on, something my old on did not and had me quite frustrated at times...Well to get back to the beginning I answered all the questions then it said the wanted my password it did not make sense to me since I had just received it and had not given it a password but I entered every password I could think of then it rejected every one then proceeded to shut me out...It keeps saying to go to this site on computed but I cannot get into the computer.  My children both looked at it but don't know what to do they say send it back but I have already threw away the wrapping I don't see how I can afford to go to repair shop and if  don't know it's secret  password how would they....What do all of you out in computer land advise me to do Joanne Price", "score": 1.0},
{"product_id": "B077PQ1VNY", "id": "R3T7E32APMSIF7", "title": "Four Stars", "text": "Works for me, the battery is not quite there yet but charges real fast.", "score": 4.0},
{"product_id": "B077PQ1VNY", "id": "R142AVVWP7LW7R", "title": "Don’t buy. Slowest computer", "text": "I finally got around to setting this computer up, and I don’t know if I got a refurbished computer or what, but it barely works. It takes FOREVER to start up and even longer to access internet, Microsoft word, anything. Pop ups all over the place, and not even when I’m on the internet. I wish there was a way to return it but unfortunately I can’t find that option. It’s just awful.", "score": 1.0},
{"product_id": "B077PQ1VNY", "id": "R2CP3D0TB3AKD1", "title": "It is very user friendly, where there touch screen ...", "text": "It is  very user friendly, where there touch screen makes life a bit more easier. It's to rage and processing speed is idealy what I needed. I must say that it satisfies all my expectations.", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "R2AMX0DY92S5X6", "title": "Five Stars", "text": "Was exactly what I was looking for.", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "RJR6IK0LBJMC9", "title": "Sucks!!", "text": "This computer sucks!! It’s so slow and freezes all the time. I don’t suggest buying it.", "score": 1.0},
{"product_id": "B077PQ1VNY", "id": "R3QZH3IHT473MM", "title": "Easy to navigate", "text": "I was surprise this laptop came with the software needed.  Easy to navigate, price was right.  Laptop is excellent for beginners.  User friendly.", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "R3852EJAXD63MO", "title": "Buy it", "text": "It slow but I love it", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "R3D8GCD5IZK8ZJ", "title": "Too good to be true, cheap but slow", "text": "Way too slow, I should have read the reviews more closely. I can’t believe a computer could be this slow, at least not a new one. HP fails again. Other than the slow speed, everything appears to function.", "score": 2.0},
{"product_id": "B077PQ1VNY", "id": "R3CEGYSX16U6TD", "title": "At first I was disappointed how sluggish it was", "text": "I got this laptop about a week ago. At first I was disappointed how sluggish it was, I discovered that after I removed the mcafee security, it ran more smoothly!!", "score": 4.0},
{"product_id": "B077PQ1VNY", "id": "R2U9995S19KEG6", "title": "I HAD TO GET A MOUSE TO BETTER SERVE MY NEEDS", "text": "MY FIRST LAPTOP - I'M IMPRESSED WITH SCREEN CLARITY & FUNCTIONS THAT IT HAS. STILL LEARNING ALL THE FEATURES IT HAS TO OFFER, I HAD TO GET A MOUSE TO BETTER SERVE MY NEEDS. BUT WORKS FAST & GREAT FOR ME NOW. I LIKE IT.", "score": 4.0},
{"product_id": "B077PQ1VNY", "id": "R3U6QT49BIMVY0", "title": "Five Stars", "text": "😍", "score": 5.0},
{"product_id": "B077PQ1VNY", "id": "RXM10RNZ3FJ9X", "title": "Liked the price most", "text": "Liked the price most, but it is slower than I thought it would be and it has been difficult to access wireless printers. Meets most basic needs, but I will spend more next time for a higher end machine.  First time buying a computer on line.", "score": 3.0},
{"product_id": "B06WD61CF5", "id": "R2N5SZKZM5S2FH", "title": "Fast boot up.", "text": "So far so good.  Boots up super quick, and shuts down super quick.  No complaints so far about anything.", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R3HXYJA91C5OCE", "title": "Acer Aspire", "text": "Fast, great looking, great investment.", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "RDBJI6658C6MY", "title": "material under case of laptop is so bad and it peeled off", "text": "I got so many problem with this laptop in 8 months.  I sent it to repair service one time. Now, Touch screen does not work and I have to sent to it to repair. Also,  material under case of laptop is so bad and it  peeled off.", "score": 2.0},
{"product_id": "B06WD61CF5", "id": "R23CAM5LOP6YYC", "title": "it's leagues better than the Alienware it replaced (mind you that one ...", "text": "I live this laptop with all my heart, it's leagues better than the Alienware it replaced (mind you that one was 6 yrs old) and it suits my diverse lifestyle, just wish it had more storage space", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "RIEBD7W2R7G7G", "title": "Five Stars", "text": "It's great", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "RGBW2FVXOKGBG", "title": "Five Stars", "text": "GOOD", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R1KMVJ9PG9APGR", "title": "Great machine.", "text": "It is delightful. Works well, slim, pretty, and pleasant to use.", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "R3I62935CTYD2A", "title": "Five Stars", "text": "Works great!", "score": 5.0},
{"product_id": "B06WD61CF5", "id": "RC649E2DYZRVC", "title": "Lightweight, good touchscreen, large display.", "text": "Seems to work OK. Lightweight, good touchscreen, large display. OK CPU.", "score": 3.0},
{"product_id": "B06WD61CF5", "id": "R2LYH914JG25UU", "title": "Great laptop! Surprisingly", "text": "Great laptop! Surprisingly, this laptop is great for gaming, work and browsing. It can handle games like Fortnite and Overwatch with ease.", "score": 5.0}
]